export const macedonianCities = [
    // Официјални градови во Македонија (од колоната "Град")
    'Берово',
    'Битола',
    'Богданци',
    'Валандово',
    'Велес',
    'Виница',
    'Гевгелија',
    'Гостивар',
    'Дебар',
    'Делчево',
    'Демир Капија',
    'Демир Хисар',
    'Дојран',
    'Кавадарци',
    'Кичево',
    'Кочани',
    'Кратово',
    'Крива Паланка',
    'Крушево',
    'Куманово',
    'Неготино',
    'Охрид',
    'Прилеп',
    'Пробиштип',
    'Радовиш',
    'Ресен',
    'Свети Николе',
    'Скопје',
    'Струга',
    'Струмица',
    'Тетово',
    'Штип'
];

export const getCityOptions = () => {
    return macedonianCities.map(city => ({
        value: city,
        label: city
    }));
};